package org.example.Baekjoon.Gold

fun main() {
    val T = readLine()!!.toInt()

    val arr = IntArray(T)

    for(i in 0 until T) {
        arr[i] = readLine()!!.toInt()
    }

    var max = arr.max()

    val dp = Array(max + 1) { IntArray(3 + 1) }
    dp[1][1] = 1    // + 1
    dp[1][2] = 0    //
    dp[1][3] = 0

    dp[2][1] = 1    // 1 + 1
    dp[2][2] = 1    // + 2
    dp[2][3] = 0

    dp[3][1] = 1    // 1 + 1 + 1
    dp[3][2] = 1    // 1 + 2
    dp[3][3] = 1    // + 3

    for(n in 4..max) {
        dp[n][1] = dp[n-1][1]
        dp[n][2] = dp[n-2][1] + dp[n-2][2]
        dp[n][3] = dp[n-3][1] + dp[n-3][2] + dp[n-3][3]
    }

    for(i in 0 until T) {
        println( dp[ arr[i] ][1] + dp[ arr[i] ][2] + dp[ arr[i] ][3] )
    }

    // n = 1
    // 1                dp[1][1]

    // n = 2
    // 2                dp[2] = 2               1
    // 1 + 1                                    1

    // n = 3
    // 1 + 1 + 1                        1
    // 1 + 2           dp[3] = 3        1         dp[3-2] = dp[1]
    // 3                                1

    // n = 4
    // 1 + 1 + 1 + 1                    1
    // 1 + 1 + 2                        2         dp[4-2] = dp[2] = 2
    // 2 + 2
    // 3 + 1                            1

    // n = 5
    // 1 + 1 + 1 + 1 + 1                           dp[4][1]에 1을 붙인 것

    // 1 + 1 + 1 + 2                               dp[3][2]에 2를 붙인 것
    // 1 + 2 + 2

    // 1 + 1 + 3                                   dp[5][3] = dp[2][1]에 3을 붙인 것 + dp[2][2]에 3을 붙인 것
    // 2 + 3

    // n = 6
    // 1 + 1 + ...                      1       dp[6][1] = dp[5][1]

    // (1 + 1 + 1 + 1) + 2
    // (1 + 1 + 2) + 2                    4       dp[6][2] = dp[4][1] + dp[4][2]
    // (2 + 2) + 2

    // (1 + 1 + 1) + 3
    // (1 + 2) + 3
    // (3) + 3                            3       dp[6][3] = dp[3][1] + dp[3][2] + dp[3][3]

    // (더해지는 숫자를 오름차순으로 나열한다고 가정)
    // dp - dp[n][num] => num을 마지막에 더할 때, n을 만들 수 있는 경우의 수

    // ex)
    // dp[6][1]
    // 1 + 1 + 1 + 1 + 1 + 1    dp[5][1]

    // dp[6][2]
    // 1 + 1 + 1 + 1 + 2        dp[4][1]

    // 1 + 1 + 2 + 2            dp[4][2]
    // 2 + 2 + 2

    // ex) dp[6][3] => 마지막에 3을 더할 때, 6을 만들 수 있는 경우의 수
    // 1 + 1 + 1 + 3    dp[3][1]
    // 1 + 2 + 3        dp[3][2]
    // 3 + 3            dp[3][3]

    // dp[6][3] = dp[3][1] + dp[3][2] + dp[3][3]

    // n = 7
    // 1 + 1 + ...                      dp[6][1]에 1을 붙인 것

    // 1 + 1 + 1 + 1 + 1 + 2            dp[5][1]에 2를 붙인 것
    // 1 + 1 + 1 + 2 + 2                dp[5][2]에 2를 붙인 것
    // 1 + 2 + 2 + 2

    // 1 + 1 + 1 + 1 + 3            dp[4][1]에 3을 붙인 것

    // 1 + 1 + 2 + 3                dp[4][2]에 3을 붙인 것
    // 2 + 2 + 3

    // 1 + 3 + 3                    dp[4][3]에 3을 붙인 것

    // dp[7][1] = dp[6][1]과 같고
    // dp[7][2] = dp[5][1] + dp[5][2]
    // dp[7][3] = dp[4][1] + dp[4][2] + dp[4][3]
}